// Получение информации по заказу
// Параметры:
//  ИдентификаторЗаказа - Строка
//  Настройкаобмена - Структура, см. tb_Транспорт.ПолучитьСтруктуруНастройкиОбмена()
//  Отказ - Булево 
Функция ПолучениеИнформацииПоЗаказу(ИдентификаторЗаказа, Настройкаобмена, Отказ) Экспорт
	
	ТаблицаПараметров = tb_Транспорт.ПолучитьТаблицуПараметров(НастройкаОбмена);
		
	tb_Транспорт.ДобавитьСтрокуТаблицаПараметров(ТаблицаПараметров, "method", "aliexpress.solution.order.info.get");
	tb_Транспорт.ДобавитьСтрокуТаблицаПараметров(ТаблицаПараметров, "param1", ПолучитьПараметрыЗапросаПолучениеПоИдентификатору(ИдентификаторЗаказа));
	
	Возврат tb_Транспорт.ЗапросКСервису(ТаблицаПараметров, Настройкаобмена, Отказ);
	
КонецФункции

Функция ПолучитьПараметрыЗапросаПолучениеПоИдентификатору(ИдентификаторЗаказа)
	
	СтруктураДанные = Новый Структура;
	СтруктураДанные.Вставить("ext_info_bit_flag", "");
	СтруктураДанные.Вставить("order_id", ИдентификаторЗаказа);
	
	Возврат tb_РаботаСоСтроками.В_JSON_СимволыВнеASCII(СтруктураДанные);
	
КонецФункции

// Разбирает соответствие ответ от сервиса, провеяет на успешность выполнения
// Параметры:
//  Ответ - Соответствие
//  СтрокаЗаголовокОтвет - Строка
Функция РезобратьРезультатОтвета_1(Ответ, СтрокаЗаголовокОтвет)
	
	РезультатУспешен = ПустаяСтрока(Ответ
	.Получить(СтрокаЗаголовокОтвет)
	.Получить("error_info"));
	
	ОписаниеОшибки = tb_РаботаСоСтроками.В_JSON(Ответ
	.Получить(СтрокаЗаголовокОтвет)
	.Получить("error_info"));
	
	Если Не РезультатУспешен Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "" + ОписаниеОшибки;
		Сообщение.Сообщить();
		
		Отказ = Истина;
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Ответ
	.Получить(СтрокаЗаголовокОтвет)
	.Получить("result");
	
КонецФункции

// Разбирает соответствие ответ от сервиса, провеяет на успешность выполнения
// Параметры:
//  Ответ - Соответствие
//  СтрокаЗаголовокОтвет - Строка
Функция РезобратьРезультатОтвета_2(Ответ, СтрокаЗаголовокОтвет)
	
	РезультатУспешен = ПустаяСтрока(Ответ
	.Получить(СтрокаЗаголовокОтвет)
	.Получить("result")
	.Получить("error_info"));
	
	ОписаниеОшибки = tb_РаботаСоСтроками.В_JSON(Ответ
	.Получить(СтрокаЗаголовокОтвет)
	.Получить("result")
	.Получить("error_info"));
	
	Если Не РезультатУспешен Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "" + ОписаниеОшибки;
		Сообщение.Сообщить();
		
		Отказ = Истина;
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Ответ
	.Получить(СтрокаЗаголовокОтвет)
	.Получить("result")
	.Получить("result");
	
КонецФункции

